---
kind: property
id: P:Autodesk.Revit.DB.Floor.SketchId
zh: 楼板、板、地板
source: html/33130afb-7bc9-0229-0c54-b99a3edc21dd.htm
---
# Autodesk.Revit.DB.Floor.SketchId Property

**中文**: 楼板、板、地板

Returns id of the sketch.

## Syntax (C#)
```csharp
public ElementId SketchId { get; }
```